GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.inc
// Register: PORTWIN1
#define PORTWIN1 PORTWIN1
PORTWIN1                                 equ 0103h
// bitfield definitions
PORTWIN1_IN_POSN                         equ 0000h
PORTWIN1_IN_POSITION                     equ 0000h
PORTWIN1_IN_SIZE                         equ 0008h
PORTWIN1_IN_LENGTH                       equ 0008h
PORTWIN1_IN_MASK                         equ 00FFh
PORTWIN1_IN0_POSN                        equ 0000h
PORTWIN1_IN0_POSITION                    equ 0000h
PORTWIN1_IN0_SIZE                        equ 0001h
PORTWIN1_IN0_LENGTH                      equ 0001h
PORTWIN1_IN0_MASK                        equ 0001h
PORTWIN1_IN1_POSN                        equ 0001h
PORTWIN1_IN1_POSITION                    equ 0001h
PORTWIN1_IN1_SIZE                        equ 0001h
PORTWIN1_IN1_LENGTH                      equ 0001h
PORTWIN1_IN1_MASK                        equ 0002h
PORTWIN1_IN2_POSN                        equ 0002h
PORTWIN1_IN2_POSITION                    equ 0002h
PORTWIN1_IN2_SIZE                        equ 0001h
PORTWIN1_IN2_LENGTH                      equ 0001h
PORTWIN1_IN2_MASK                        equ 0004h
PORTWIN1_IN3_POSN                        equ 0003h
PORTWIN1_IN3_POSITION                    equ 0003h
PORTWIN1_IN3_SIZE                        equ 0001h
PORTWIN1_IN3_LENGTH                      equ 0001h
PORTWIN1_IN3_MASK                        equ 0008h

// Register: PORTWIN2
#define PORTWIN2 PORTWIN2
PORTWIN2                                 equ 0104h
// bitfield definitions
PORTWIN2_IN_POSN                         equ 0000h
PORTWIN2_IN_POSITION                     equ 0000h
PORTWIN2_IN_SIZE                         equ 0008h
PORTWIN2_IN_LENGTH                       equ 0008h
PORTWIN2_IN_MASK                         equ 00FFh
PORTWIN2_IN0_POSN                        equ 0000h
PORTWIN2_IN0_POSITION                    equ 0000h
PORTWIN2_IN0_SIZE                        equ 0001h
PORTWIN2_IN0_LENGTH                      equ 0001h
PORTWIN2_IN0_MASK                        equ 0001h
PORTWIN2_IN1_POSN                        equ 0001h
PORTWIN2_IN1_POSITION                    equ 0001h
PORTWIN2_IN1_SIZE                        equ 0001h
PORTWIN2_IN1_LENGTH                      equ 0001h
PORTWIN2_IN1_MASK                        equ 0002h
PORTWIN2_IN2_POSN                        equ 0002h
PORTWIN2_IN2_POSITION                    equ 0002h
PORTWIN2_IN2_SIZE                        equ 0001h
PORTWIN2_IN2_LENGTH                      equ 0001h
PORTWIN2_IN2_MASK                        equ 0004h
PORTWIN2_IN3_POSN                        equ 0003h
PORTWIN2_IN3_POSITION                    equ 0003h
PORTWIN2_IN3_SIZE                        equ 0001h
PORTWIN2_IN3_LENGTH                      equ 0001h
PORTWIN2_IN3_MASK                        equ 0008h

// Register: PORTWIN3
#define PORTWIN3 PORTWIN3
PORTWIN3                                 equ 0105h
// bitfield definitions
PORTWIN3_IN_POSN                         equ 0000h
PORTWIN3_IN_POSITION                     equ 0000h
PORTWIN3_IN_SIZE                         equ 0008h
PORTWIN3_IN_LENGTH                       equ 0008h
PORTWIN3_IN_MASK                         equ 00FFh
PORTWIN3_IN0_POSN                        equ 0000h
PORTWIN3_IN0_POSITION                    equ 0000h
PORTWIN3_IN0_SIZE                        equ 0001h
PORTWIN3_IN0_LENGTH                      equ 0001h
PORTWIN3_IN0_MASK                        equ 0001h
PORTWIN3_IN1_POSN                        equ 0001h
PORTWIN3_IN1_POSITION                    equ 0001h
PORTWIN3_IN1_SIZE                        equ 0001h
PORTWIN3_IN1_LENGTH                      equ 0001h
PORTWIN3_IN1_MASK                        equ 0002h
PORTWIN3_IN2_POSN                        equ 0002h
PORTWIN3_IN2_POSITION                    equ 0002h
PORTWIN3_IN2_SIZE                        equ 0001h
PORTWIN3_IN2_LENGTH                      equ 0001h
PORTWIN3_IN2_MASK                        equ 0004h
PORTWIN3_IN3_POSN                        equ 0003h
PORTWIN3_IN3_POSITION                    equ 0003h
PORTWIN3_IN3_SIZE                        equ 0001h
PORTWIN3_IN3_LENGTH                      equ 0001h
PORTWIN3_IN3_MASK                        equ 0008h

// Register: PORTWIN4
#define PORTWIN4 PORTWIN4
PORTWIN4                                 equ 0106h
// bitfield definitions
PORTWIN4_IN_POSN                         equ 0000h
PORTWIN4_IN_POSITION                     equ 0000h
PORTWIN4_IN_SIZE                         equ 0008h
PORTWIN4_IN_LENGTH                       equ 0008h
PORTWIN4_IN_MASK                         equ 00FFh
PORTWIN4_IN0_POSN                        equ 0000h
PORTWIN4_IN0_POSITION                    equ 0000h
PORTWIN4_IN0_SIZE                        equ 0001h
PORTWIN4_IN0_LENGTH                      equ 0001h
PORTWIN4_IN0_MASK                        equ 0001h
PORTWIN4_IN1_POSN                        equ 0001h
PORTWIN4_IN1_POSITION                    equ 0001h
PORTWIN4_IN1_SIZE                        equ 0001h
PORTWIN4_IN1_LENGTH                      equ 0001h
PORTWIN4_IN1_MASK                        equ 0002h
PORTWIN4_IN2_POSN                        equ 0002h
PORTWIN4_IN2_POSITION                    equ 0002h
PORTWIN4_IN2_SIZE                        equ 0001h
PORTWIN4_IN2_LENGTH                      equ 0001h
PORTWIN4_IN2_MASK                        equ 0004h
PORTWIN4_IN3_POSN                        equ 0003h
PORTWIN4_IN3_POSITION                    equ 0003h
PORTWIN4_IN3_SIZE                        equ 0001h
PORTWIN4_IN3_LENGTH                      equ 0001h
PORTWIN4_IN3_MASK                        equ 0008h

// Register: PORTWIN5
#define PORTWIN5 PORTWIN5
PORTWIN5                                 equ 0107h
// bitfield definitions
PORTWIN5_IN_POSN                         equ 0000h
PORTWIN5_IN_POSITION                     equ 0000h
PORTWIN5_IN_SIZE                         equ 0008h
PORTWIN5_IN_LENGTH                       equ 0008h
PORTWIN5_IN_MASK                         equ 00FFh
PORTWIN5_IN0_POSN                        equ 0000h
PORTWIN5_IN0_POSITION                    equ 0000h
PORTWIN5_IN0_SIZE                        equ 0001h
PORTWIN5_IN0_LENGTH                      equ 0001h
PORTWIN5_IN0_MASK                        equ 0001h
PORTWIN5_IN1_POSN                        equ 0001h
PORTWIN5_IN1_POSITION                    equ 0001h
PORTWIN5_IN1_SIZE                        equ 0001h
PORTWIN5_IN1_LENGTH                      equ 0001h
PORTWIN5_IN1_MASK                        equ 0002h
PORTWIN5_IN2_POSN                        equ 0002h
PORTWIN5_IN2_POSITION                    equ 0002h
PORTWIN5_IN2_SIZE                        equ 0001h
PORTWIN5_IN2_LENGTH                      equ 0001h
PORTWIN5_IN2_MASK                        equ 0004h
PORTWIN5_IN3_POSN                        equ 0003h
PORTWIN5_IN3_POSITION                    equ 0003h
PORTWIN5_IN3_SIZE                        equ 0001h
PORTWIN5_IN3_LENGTH                      equ 0001h
PORTWIN5_IN3_MASK                        equ 0008h

// Register: PORTWIN6
#define PORTWIN6 PORTWIN6
PORTWIN6                                 equ 0108h
// bitfield definitions
PORTWIN6_IN_POSN                         equ 0000h
PORTWIN6_IN_POSITION                     equ 0000h
PORTWIN6_IN_SIZE                         equ 0008h
PORTWIN6_IN_LENGTH                       equ 0008h
PORTWIN6_IN_MASK                         equ 00FFh
PORTWIN6_IN0_POSN                        equ 0000h
PORTWIN6_IN0_POSITION                    equ 0000h
PORTWIN6_IN0_SIZE                        equ 0001h
PORTWIN6_IN0_LENGTH                      equ 0001h
PORTWIN6_IN0_MASK                        equ 0001h
PORTWIN6_IN1_POSN                        equ 0001h
PORTWIN6_IN1_POSITION                    equ 0001h
PORTWIN6_IN1_SIZE                        equ 0001h
PORTWIN6_IN1_LENGTH                      equ 0001h
PORTWIN6_IN1_MASK                        equ 0002h
PORTWIN6_IN2_POSN                        equ 0002h
PORTWIN6_IN2_POSITION                    equ 0002h
PORTWIN6_IN2_SIZE                        equ 0001h
PORTWIN6_IN2_LENGTH                      equ 0001h
PORTWIN6_IN2_MASK                        equ 0004h
PORTWIN6_IN3_POSN                        equ 0003h
PORTWIN6_IN3_POSITION                    equ 0003h
PORTWIN6_IN3_SIZE                        equ 0001h
PORTWIN6_IN3_LENGTH                      equ 0001h
PORTWIN6_IN3_MASK                        equ 0008h

// Register: PORTWIN7
#define PORTWIN7 PORTWIN7
PORTWIN7                                 equ 0109h
// bitfield definitions
PORTWIN7_IN_POSN                         equ 0000h
PORTWIN7_IN_POSITION                     equ 0000h
PORTWIN7_IN_SIZE                         equ 0008h
PORTWIN7_IN_LENGTH                       equ 0008h
PORTWIN7_IN_MASK                         equ 00FFh
PORTWIN7_IN0_POSN                        equ 0000h
PORTWIN7_IN0_POSITION                    equ 0000h
PORTWIN7_IN0_SIZE                        equ 0001h
PORTWIN7_IN0_LENGTH                      equ 0001h
PORTWIN7_IN0_MASK                        equ 0001h
PORTWIN7_IN1_POSN                        equ 0001h
PORTWIN7_IN1_POSITION                    equ 0001h
PORTWIN7_IN1_SIZE                        equ 0001h
PORTWIN7_IN1_LENGTH                      equ 0001h
PORTWIN7_IN1_MASK                        equ 0002h
PORTWIN7_IN2_POSN                        equ 0002h
PORTWIN7_IN2_POSITION                    equ 0002h
PORTWIN7_IN2_SIZE                        equ 0001h
PORTWIN7_IN2_LENGTH                      equ 0001h
PORTWIN7_IN2_MASK                        equ 0004h
PORTWIN7_IN3_POSN                        equ 0003h
PORTWIN7_IN3_POSITION                    equ 0003h
PORTWIN7_IN3_SIZE                        equ 0001h
PORTWIN7_IN3_LENGTH                      equ 0001h
PORTWIN7_IN3_MASK                        equ 0008h

// Register: PORTWCLK
#define PORTWCLK PORTWCLK
PORTWCLK                                 equ 010Ah
// bitfield definitions
PORTWCLK_CLK_POSN                        equ 0000h
PORTWCLK_CLK_POSITION                    equ 0000h
PORTWCLK_CLK_SIZE                        equ 0008h
PORTWCLK_CLK_LENGTH                      equ 0008h
PORTWCLK_CLK_MASK                        equ 00FFh
PORTWCLK_CLK0_POSN                       equ 0000h
PORTWCLK_CLK0_POSITION                   equ 0000h
PORTWCLK_CLK0_SIZE                       equ 0001h
PORTWCLK_CLK0_LENGTH                     equ 0001h
PORTWCLK_CLK0_MASK                       equ 0001h
PORTWCLK_CLK1_POSN                       equ 0001h
PORTWCLK_CLK1_POSITION                   equ 0001h
PORTWCLK_CLK1_SIZE                       equ 0001h
PORTWCLK_CLK1_LENGTH                     equ 0001h
PORTWCLK_CLK1_MASK                       equ 0002h
PORTWCLK_CLK2_POSN                       equ 0002h
PORTWCLK_CLK2_POSITION                   equ 0002h
PORTWCLK_CLK2_SIZE                       equ 0001h
PORTWCLK_CLK2_LENGTH                     equ 0001h
PORTWCLK_CLK2_MASK                       equ 0004h
PORTWCLK_CLK3_POSN                       equ 0003h
PORTWCLK_CLK3_POSITION                   equ 0003h
PORTWCLK_CLK3_SIZE                       equ 0001h
PORTWCLK_CLK3_LENGTH                     equ 0001h
PORTWCLK_CLK3_MASK                       equ 0008h
PORTWCLK_CLK4_POSN                       equ 0004h
PORTWCLK_CLK4_POSITION                   equ 0004h
PORTWCLK_CLK4_SIZE                       equ 0001h
PORTWCLK_CLK4_LENGTH                     equ 0001h
PORTWCLK_CLK4_MASK                       equ 0010h
PORTWCLK_PWCLK_POSN                      equ 0000h
PORTWCLK_PWCLK_POSITION                  equ 0000h
PORTWCLK_PWCLK_SIZE                      equ 0008h
PORTWCLK_PWCLK_LENGTH                    equ 0008h
PORTWCLK_PWCLK_MASK                      equ 00FFh

// Register: PORTWDF
#define PORTWDF PORTWDF
PORTWDF                                  equ 010Bh
// bitfield definitions
PORTWDF_DF0_POSN                         equ 0000h
PORTWDF_DF0_POSITION                     equ 0000h
PORTWDF_DF0_SIZE                         equ 0001h
PORTWDF_DF0_LENGTH                       equ 0001h
PORTWDF_DF0_MASK                         equ 0001h
PORTWDF_DF1_POSN                         equ 0001h
PORTWDF_DF1_POSITION                     equ 0001h
PORTWDF_DF1_SIZE                         equ 0001h
PORTWDF_DF1_LENGTH                       equ 0001h
PORTWDF_DF1_MASK                         equ 0002h
PORTWDF_DF2_POSN                         equ 0002h
PORTWDF_DF2_POSITION                     equ 0002h
PORTWDF_DF2_SIZE                         equ 0001h
PORTWDF_DF2_LENGTH                       equ 0001h
PORTWDF_DF2_MASK                         equ 0004h
PORTWDF_DF3_POSN                         equ 0003h
PORTWDF_DF3_POSITION                     equ 0003h
PORTWDF_DF3_SIZE                         equ 0001h
PORTWDF_DF3_LENGTH                       equ 0001h
PORTWDF_DF3_MASK                         equ 0008h
PORTWDF_DF4_POSN                         equ 0004h
PORTWDF_DF4_POSITION                     equ 0004h
PORTWDF_DF4_SIZE                         equ 0001h
PORTWDF_DF4_LENGTH                       equ 0001h
PORTWDF_DF4_MASK                         equ 0010h
PORTWDF_DF5_POSN                         equ 0005h
PORTWDF_DF5_POSITION                     equ 0005h
PORTWDF_DF5_SIZE                         equ 0001h
PORTWDF_DF5_LENGTH                       equ 0001h
PORTWDF_DF5_MASK                         equ 0020h
PORTWDF_DF6_POSN                         equ 0006h
PORTWDF_DF6_POSITION                     equ 0006h
PORTWDF_DF6_SIZE                         equ 0001h
PORTWDF_DF6_LENGTH                       equ 0001h
PORTWDF_DF6_MASK                         equ 0040h
PORTWDF_DF7_POSN                         equ 0007h
PORTWDF_DF7_POSITION                     equ 0007h
PORTWDF_DF7_SIZE                         equ 0001h
PORTWDF_DF7_LENGTH                       equ 0001h
PORTWDF_DF7_MASK                         equ 0080h
PORTWDF_PWDF0_POSN                       equ 0000h
PORTWDF_PWDF0_POSITION                   equ 0000h
PORTWDF_PWDF0_SIZE                       equ 0001h
PORTWDF_PWDF0_LENGTH                     equ 0001h
PORTWDF_PWDF0_MASK                       equ 0001h
PORTWDF_PWDF1_POSN                       equ 0001h
PORTWDF_PWDF1_POSITION                   equ 0001h
PORTWDF_PWDF1_SIZE                       equ 0001h
PORTWDF_PWDF1_LENGTH                     equ 0001h
PORTWDF_PWDF1_MASK                       equ 0002h
PORTWDF_PWDF2_POSN                       equ 0002h
PORTWDF_PWDF2_POSITION                   equ 0002h
PORTWDF_PWDF2_SIZE                       equ 0001h
PORTWDF_PWDF2_LENGTH                     equ 0001h
PORTWDF_PWDF2_MASK                       equ 0004h
PORTWDF_PWDF3_POSN                       equ 0003h
PORTWDF_PWDF3_POSITION                   equ 0003h
PORTWDF_PWDF3_SIZE                       equ 0001h
PORTWDF_PWDF3_LENGTH                     equ 0001h
PORTWDF_PWDF3_MASK                       equ 0008h
PORTWDF_PWDF4_POSN                       equ 0004h
PORTWDF_PWDF4_POSITION                   equ 0004h
PORTWDF_PWDF4_SIZE                       equ 0001h
PORTWDF_PWDF4_LENGTH                     equ 0001h
PORTWDF_PWDF4_MASK                       equ 0010h
PORTWDF_PWDF5_POSN                       equ 0005h
PORTWDF_PWDF5_POSITION                   equ 0005h
PORTWDF_PWDF5_SIZE                       equ 0001h
PORTWDF_PWDF5_LENGTH                     equ 0001h
PORTWDF_PWDF5_MASK                       equ 0020h
PORTWDF_PWDF6_POSN                       equ 0006h
PORTWDF_PWDF6_POSITION                   equ 0006h
PORTWDF_PWDF6_SIZE                       equ 0001h
PORTWDF_PWDF6_LENGTH                     equ 0001h
PORTWDF_PWDF6_MASK                       equ 0040h
PORTWDF_PWDF7_POSN                       equ 0007h
PORTWDF_PWDF7_POSITION                   equ 0007h
PORTWDF_PWDF7_SIZE                       equ 0001h
PORTWDF_PWDF7_LENGTH                     equ 0001h
PORTWDF_PWDF7_MASK                       equ 0080h
PORTWDF_DF_POSN                          equ 0000h
PORTWDF_DF_POSITION                      equ 0000h
PORTWDF_DF_SIZE                          equ 0008h
PORTWDF_DF_LENGTH                        equ 0008h
PORTWDF_DF_MASK                          equ 00FFh
PORTWDF_PWDF_POSN                        equ 0000h
PORTWDF_PWDF_POSITION                    equ 0000h
PORTWDF_PWDF_SIZE                        equ 0008h
PORTWDF_PWDF_LENGTH                      equ 0008h
PORTWDF_PWDF_MASK                        equ 00FFh

// Register: VPORTCON
#define VPORTCON VPORTCON
VPORTCON                                 equ 010Ch
// bitfield definitions
VPORTCON_PWCLKEN_POSN                    equ 0000h
VPORTCON_PWCLKEN_POSITION                equ 0000h
VPORTCON_PWCLKEN_SIZE                    equ 0001h
VPORTCON_PWCLKEN_LENGTH                  equ 0001h
VPORTCON_PWCLKEN_MASK                    equ 0001h

// Register: ADCGA
#define ADCGA ADCGA
ADCGA                                    equ 0110h
// bitfield definitions
ADCGA_CGA0_POSN                          equ 0000h
ADCGA_CGA0_POSITION                      equ 0000h
ADCGA_CGA0_SIZE                          equ 0001h
ADCGA_CGA0_LENGTH                        equ 0001h
ADCGA_CGA0_MASK                          equ 0001h
ADCGA_CGA1_POSN                          equ 0001h
ADCGA_CGA1_POSITION                      equ 0001h
ADCGA_CGA1_SIZE                          equ 0001h
ADCGA_CGA1_LENGTH                        equ 0001h
ADCGA_CGA1_MASK                          equ 0002h
ADCGA_CGA2_POSN                          equ 0002h
ADCGA_CGA2_POSITION                      equ 0002h
ADCGA_CGA2_SIZE                          equ 0001h
ADCGA_CGA2_LENGTH                        equ 0001h
ADCGA_CGA2_MASK                          equ 0004h
ADCGA_CGA3_POSN                          equ 0003h
ADCGA_CGA3_POSITION                      equ 0003h
ADCGA_CGA3_SIZE                          equ 0001h
ADCGA_CGA3_LENGTH                        equ 0001h
ADCGA_CGA3_MASK                          equ 0008h
ADCGA_CGA4_POSN                          equ 0004h
ADCGA_CGA4_POSITION                      equ 0004h
ADCGA_CGA4_SIZE                          equ 0001h
ADCGA_CGA4_LENGTH                        equ 0001h
ADCGA_CGA4_MASK                          equ 0010h
ADCGA_CGA5_POSN                          equ 0005h
ADCGA_CGA5_POSITION                      equ 0005h
ADCGA_CGA5_SIZE                          equ 0001h
ADCGA_CGA5_LENGTH                        equ 0001h
ADCGA_CGA5_MASK                          equ 0020h
ADCGA_CGA6_POSN                          equ 0006h
ADCGA_CGA6_POSITION                      equ 0006h
ADCGA_CGA6_SIZE                          equ 0001h
ADCGA_CGA6_LENGTH                        equ 0001h
ADCGA_CGA6_MASK                          equ 0040h
ADCGA_CGA7_POSN                          equ 0007h
ADCGA_CGA7_POSITION                      equ 0007h
ADCGA_CGA7_SIZE                          equ 0001h
ADCGA_CGA7_LENGTH                        equ 0001h
ADCGA_CGA7_MASK                          equ 0080h
ADCGA_ADCGA0_POSN                        equ 0000h
ADCGA_ADCGA0_POSITION                    equ 0000h
ADCGA_ADCGA0_SIZE                        equ 0001h
ADCGA_ADCGA0_LENGTH                      equ 0001h
ADCGA_ADCGA0_MASK                        equ 0001h
ADCGA_ADCGA1_POSN                        equ 0001h
ADCGA_ADCGA1_POSITION                    equ 0001h
ADCGA_ADCGA1_SIZE                        equ 0001h
ADCGA_ADCGA1_LENGTH                      equ 0001h
ADCGA_ADCGA1_MASK                        equ 0002h
ADCGA_ADCGA2_POSN                        equ 0002h
ADCGA_ADCGA2_POSITION                    equ 0002h
ADCGA_ADCGA2_SIZE                        equ 0001h
ADCGA_ADCGA2_LENGTH                      equ 0001h
ADCGA_ADCGA2_MASK                        equ 0004h
ADCGA_ADCGA3_POSN                        equ 0003h
ADCGA_ADCGA3_POSITION                    equ 0003h
ADCGA_ADCGA3_SIZE                        equ 0001h
ADCGA_ADCGA3_LENGTH                      equ 0001h
ADCGA_ADCGA3_MASK                        equ 0008h
ADCGA_ADCGA4_POSN                        equ 0004h
ADCGA_ADCGA4_POSITION                    equ 0004h
ADCGA_ADCGA4_SIZE                        equ 0001h
ADCGA_ADCGA4_LENGTH                      equ 0001h
ADCGA_ADCGA4_MASK                        equ 0010h
ADCGA_ADCGA5_POSN                        equ 0005h
ADCGA_ADCGA5_POSITION                    equ 0005h
ADCGA_ADCGA5_SIZE                        equ 0001h
ADCGA_ADCGA5_LENGTH                      equ 0001h
ADCGA_ADCGA5_MASK                        equ 0020h
ADCGA_ADCGA6_POSN                        equ 0006h
ADCGA_ADCGA6_POSITION                    equ 0006h
ADCGA_ADCGA6_SIZE                        equ 0001h
ADCGA_ADCGA6_LENGTH                      equ 0001h
ADCGA_ADCGA6_MASK                        equ 0040h
ADCGA_ADCGA7_POSN                        equ 0007h
ADCGA_ADCGA7_POSITION                    equ 0007h
ADCGA_ADCGA7_SIZE                        equ 0001h
ADCGA_ADCGA7_LENGTH                      equ 0001h
ADCGA_ADCGA7_MASK                        equ 0080h

