GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.inc
// Register: ADCGE
#define ADCGE ADCGE
ADCGE                                    equ 0114h
// bitfield definitions
ADCGE_CGE0_POSN                          equ 0000h
ADCGE_CGE0_POSITION                      equ 0000h
ADCGE_CGE0_SIZE                          equ 0001h
ADCGE_CGE0_LENGTH                        equ 0001h
ADCGE_CGE0_MASK                          equ 0001h
ADCGE_CGE1_POSN                          equ 0001h
ADCGE_CGE1_POSITION                      equ 0001h
ADCGE_CGE1_SIZE                          equ 0001h
ADCGE_CGE1_LENGTH                        equ 0001h
ADCGE_CGE1_MASK                          equ 0002h
ADCGE_CGE2_POSN                          equ 0002h
ADCGE_CGE2_POSITION                      equ 0002h
ADCGE_CGE2_SIZE                          equ 0001h
ADCGE_CGE2_LENGTH                        equ 0001h
ADCGE_CGE2_MASK                          equ 0004h
ADCGE_ADCGE0_POSN                        equ 0000h
ADCGE_ADCGE0_POSITION                    equ 0000h
ADCGE_ADCGE0_SIZE                        equ 0001h
ADCGE_ADCGE0_LENGTH                      equ 0001h
ADCGE_ADCGE0_MASK                        equ 0001h
ADCGE_ADCGE1_POSN                        equ 0001h
ADCGE_ADCGE1_POSITION                    equ 0001h
ADCGE_ADCGE1_SIZE                        equ 0001h
ADCGE_ADCGE1_LENGTH                      equ 0001h
ADCGE_ADCGE1_MASK                        equ 0002h
ADCGE_ADCGE2_POSN                        equ 0002h
ADCGE_ADCGE2_POSITION                    equ 0002h
ADCGE_ADCGE2_SIZE                        equ 0001h
ADCGE_ADCGE2_LENGTH                      equ 0001h
ADCGE_ADCGE2_MASK                        equ 0004h

// Register: ADCGF
#define ADCGF ADCGF
ADCGF                                    equ 0115h
// bitfield definitions
ADCGF_CGF0_POSN                          equ 0000h
ADCGF_CGF0_POSITION                      equ 0000h
ADCGF_CGF0_SIZE                          equ 0001h
ADCGF_CGF0_LENGTH                        equ 0001h
ADCGF_CGF0_MASK                          equ 0001h
ADCGF_CGF1_POSN                          equ 0001h
ADCGF_CGF1_POSITION                      equ 0001h
ADCGF_CGF1_SIZE                          equ 0001h
ADCGF_CGF1_LENGTH                        equ 0001h
ADCGF_CGF1_MASK                          equ 0002h
ADCGF_CGF2_POSN                          equ 0002h
ADCGF_CGF2_POSITION                      equ 0002h
ADCGF_CGF2_SIZE                          equ 0001h
ADCGF_CGF2_LENGTH                        equ 0001h
ADCGF_CGF2_MASK                          equ 0004h
ADCGF_CGF3_POSN                          equ 0003h
ADCGF_CGF3_POSITION                      equ 0003h
ADCGF_CGF3_SIZE                          equ 0001h
ADCGF_CGF3_LENGTH                        equ 0001h
ADCGF_CGF3_MASK                          equ 0008h
ADCGF_CGF4_POSN                          equ 0004h
ADCGF_CGF4_POSITION                      equ 0004h
ADCGF_CGF4_SIZE                          equ 0001h
ADCGF_CGF4_LENGTH                        equ 0001h
ADCGF_CGF4_MASK                          equ 0010h
ADCGF_CGF5_POSN                          equ 0005h
ADCGF_CGF5_POSITION                      equ 0005h
ADCGF_CGF5_SIZE                          equ 0001h
ADCGF_CGF5_LENGTH                        equ 0001h
ADCGF_CGF5_MASK                          equ 0020h
ADCGF_CGF6_POSN                          equ 0006h
ADCGF_CGF6_POSITION                      equ 0006h
ADCGF_CGF6_SIZE                          equ 0001h
ADCGF_CGF6_LENGTH                        equ 0001h
ADCGF_CGF6_MASK                          equ 0040h
ADCGF_CGF7_POSN                          equ 0007h
ADCGF_CGF7_POSITION                      equ 0007h
ADCGF_CGF7_SIZE                          equ 0001h
ADCGF_CGF7_LENGTH                        equ 0001h
ADCGF_CGF7_MASK                          equ 0080h
ADCGF_ADCGF0_POSN                        equ 0000h
ADCGF_ADCGF0_POSITION                    equ 0000h
ADCGF_ADCGF0_SIZE                        equ 0001h
ADCGF_ADCGF0_LENGTH                      equ 0001h
ADCGF_ADCGF0_MASK                        equ 0001h
ADCGF_ADCGF1_POSN                        equ 0001h
ADCGF_ADCGF1_POSITION                    equ 0001h
ADCGF_ADCGF1_SIZE                        equ 0001h
ADCGF_ADCGF1_LENGTH                      equ 0001h
ADCGF_ADCGF1_MASK                        equ 0002h
ADCGF_ADCGF2_POSN                        equ 0002h
ADCGF_ADCGF2_POSITION                    equ 0002h
ADCGF_ADCGF2_SIZE                        equ 0001h
ADCGF_ADCGF2_LENGTH                      equ 0001h
ADCGF_ADCGF2_MASK                        equ 0004h
ADCGF_ADCGF3_POSN                        equ 0003h
ADCGF_ADCGF3_POSITION                    equ 0003h
ADCGF_ADCGF3_SIZE                        equ 0001h
ADCGF_ADCGF3_LENGTH                      equ 0001h
ADCGF_ADCGF3_MASK                        equ 0008h
ADCGF_ADCGF4_POSN                        equ 0004h
ADCGF_ADCGF4_POSITION                    equ 0004h
ADCGF_ADCGF4_SIZE                        equ 0001h
ADCGF_ADCGF4_LENGTH                      equ 0001h
ADCGF_ADCGF4_MASK                        equ 0010h
ADCGF_ADCGF5_POSN                        equ 0005h
ADCGF_ADCGF5_POSITION                    equ 0005h
ADCGF_ADCGF5_SIZE                        equ 0001h
ADCGF_ADCGF5_LENGTH                      equ 0001h
ADCGF_ADCGF5_MASK                        equ 0020h
ADCGF_ADCGF6_POSN                        equ 0006h
ADCGF_ADCGF6_POSITION                    equ 0006h
ADCGF_ADCGF6_SIZE                        equ 0001h
ADCGF_ADCGF6_LENGTH                      equ 0001h
ADCGF_ADCGF6_MASK                        equ 0040h
ADCGF_ADCGF7_POSN                        equ 0007h
ADCGF_ADCGF7_POSITION                    equ 0007h
ADCGF_ADCGF7_SIZE                        equ 0001h
ADCGF_ADCGF7_LENGTH                      equ 0001h
ADCGF_ADCGF7_MASK                        equ 0080h

// Register: OPA1CON0
#define OPA1CON0 OPA1CON0
OPA1CON0                                 equ 011Fh
// bitfield definitions
OPA1CON0_UG_POSN                         equ 0003h
OPA1CON0_UG_POSITION                     equ 0003h
OPA1CON0_UG_SIZE                         equ 0001h
OPA1CON0_UG_LENGTH                       equ 0001h
OPA1CON0_UG_MASK                         equ 0008h
OPA1CON0_CPON_POSN                       equ 0005h
OPA1CON0_CPON_POSITION                   equ 0005h
OPA1CON0_CPON_SIZE                       equ 0001h
OPA1CON0_CPON_LENGTH                     equ 0001h
OPA1CON0_CPON_MASK                       equ 0020h
OPA1CON0_EN_POSN                         equ 0007h
OPA1CON0_EN_POSITION                     equ 0007h
OPA1CON0_EN_SIZE                         equ 0001h
OPA1CON0_EN_LENGTH                       equ 0001h
OPA1CON0_EN_MASK                         equ 0080h
OPA1CON0_UG0_POSN                        equ 0003h
OPA1CON0_UG0_POSITION                    equ 0003h
OPA1CON0_UG0_SIZE                        equ 0001h
OPA1CON0_UG0_LENGTH                      equ 0001h
OPA1CON0_UG0_MASK                        equ 0008h
OPA1CON0_OPA1UG_POSN                     equ 0003h
OPA1CON0_OPA1UG_POSITION                 equ 0003h
OPA1CON0_OPA1UG_SIZE                     equ 0001h
OPA1CON0_OPA1UG_LENGTH                   equ 0001h
OPA1CON0_OPA1UG_MASK                     equ 0008h
OPA1CON0_OPA1CPON_POSN                   equ 0005h
OPA1CON0_OPA1CPON_POSITION               equ 0005h
OPA1CON0_OPA1CPON_SIZE                   equ 0001h
OPA1CON0_OPA1CPON_LENGTH                 equ 0001h
OPA1CON0_OPA1CPON_MASK                   equ 0020h
OPA1CON0_OPA1EN_POSN                     equ 0007h
OPA1CON0_OPA1EN_POSITION                 equ 0007h
OPA1CON0_OPA1EN_SIZE                     equ 0001h
OPA1CON0_OPA1EN_LENGTH                   equ 0001h
OPA1CON0_OPA1EN_MASK                     equ 0080h

// Register: OPA1CON1
#define OPA1CON1 OPA1CON1
OPA1CON1                                 equ 0120h
// bitfield definitions
OPA1CON1_NSS_POSN                        equ 0000h
OPA1CON1_NSS_POSITION                    equ 0000h
OPA1CON1_NSS_SIZE                        equ 0003h
OPA1CON1_NSS_LENGTH                      equ 0003h
OPA1CON1_NSS_MASK                        equ 0007h
OPA1CON1_RESON_POSN                      equ 0003h
OPA1CON1_RESON_POSITION                  equ 0003h
OPA1CON1_RESON_SIZE                      equ 0001h
OPA1CON1_RESON_LENGTH                    equ 0001h
OPA1CON1_RESON_MASK                      equ 0008h
OPA1CON1_GSEL_POSN                       equ 0004h
OPA1CON1_GSEL_POSITION                   equ 0004h
OPA1CON1_GSEL_SIZE                       equ 0003h
OPA1CON1_GSEL_LENGTH                     equ 0003h
OPA1CON1_GSEL_MASK                       equ 0070h
OPA1CON1_NSS0_POSN                       equ 0000h
OPA1CON1_NSS0_POSITION                   equ 0000h
OPA1CON1_NSS0_SIZE                       equ 0001h
OPA1CON1_NSS0_LENGTH                     equ 0001h
OPA1CON1_NSS0_MASK                       equ 0001h
OPA1CON1_NSS1_POSN                       equ 0001h
OPA1CON1_NSS1_POSITION                   equ 0001h
OPA1CON1_NSS1_SIZE                       equ 0001h
OPA1CON1_NSS1_LENGTH                     equ 0001h
OPA1CON1_NSS1_MASK                       equ 0002h
OPA1CON1_NSS2_POSN                       equ 0002h
OPA1CON1_NSS2_POSITION                   equ 0002h
OPA1CON1_NSS2_SIZE                       equ 0001h
OPA1CON1_NSS2_LENGTH                     equ 0001h
OPA1CON1_NSS2_MASK                       equ 0004h
OPA1CON1_GSEL0_POSN                      equ 0004h
OPA1CON1_GSEL0_POSITION                  equ 0004h
OPA1CON1_GSEL0_SIZE                      equ 0001h
OPA1CON1_GSEL0_LENGTH                    equ 0001h
OPA1CON1_GSEL0_MASK                      equ 0010h
OPA1CON1_GSEL1_POSN                      equ 0005h
OPA1CON1_GSEL1_POSITION                  equ 0005h
OPA1CON1_GSEL1_SIZE                      equ 0001h
OPA1CON1_GSEL1_LENGTH                    equ 0001h
OPA1CON1_GSEL1_MASK                      equ 0020h
OPA1CON1_GSEL2_POSN                      equ 0006h
OPA1CON1_GSEL2_POSITION                  equ 0006h
OPA1CON1_GSEL2_SIZE                      equ 0001h
OPA1CON1_GSEL2_LENGTH                    equ 0001h
OPA1CON1_GSEL2_MASK                      equ 0040h
OPA1CON1_OPA1NSS_POSN                    equ 0000h
OPA1CON1_OPA1NSS_POSITION                equ 0000h
OPA1CON1_OPA1NSS_SIZE                    equ 0003h
OPA1CON1_OPA1NSS_LENGTH                  equ 0003h
OPA1CON1_OPA1NSS_MASK                    equ 0007h
OPA1CON1_OPA1RESON_POSN                  equ 0003h
OPA1CON1_OPA1RESON_POSITION              equ 0003h
OPA1CON1_OPA1RESON_SIZE                  equ 0001h
OPA1CON1_OPA1RESON_LENGTH                equ 0001h
OPA1CON1_OPA1RESON_MASK                  equ 0008h
OPA1CON1_OPA1GSEL_POSN                   equ 0004h
OPA1CON1_OPA1GSEL_POSITION               equ 0004h
OPA1CON1_OPA1GSEL_SIZE                   equ 0003h
OPA1CON1_OPA1GSEL_LENGTH                 equ 0003h
OPA1CON1_OPA1GSEL_MASK                   equ 0070h
OPA1CON1_OPA1NSS0_POSN                   equ 0000h
OPA1CON1_OPA1NSS0_POSITION               equ 0000h
OPA1CON1_OPA1NSS0_SIZE                   equ 0001h
OPA1CON1_OPA1NSS0_LENGTH                 equ 0001h
OPA1CON1_OPA1NSS0_MASK                   equ 0001h
OPA1CON1_OPA1NSS1_POSN                   equ 0001h
OPA1CON1_OPA1NSS1_POSITION               equ 0001h
OPA1CON1_OPA1NSS1_SIZE                   equ 0001h
OPA1CON1_OPA1NSS1_LENGTH                 equ 0001h
OPA1CON1_OPA1NSS1_MASK                   equ 0002h
OPA1CON1_OPA1NSS2_POSN                   equ 0002h
OPA1CON1_OPA1NSS2_POSITION               equ 0002h
OPA1CON1_OPA1NSS2_SIZE                   equ 0001h
OPA1CON1_OPA1NSS2_LENGTH                 equ 0001h
OPA1CON1_OPA1NSS2_MASK                   equ 0004h
OPA1CON1_OPA1GSEL0_POSN                  equ 0004h
OPA1CON1_OPA1GSEL0_POSITION              equ 0004h
OPA1CON1_OPA1GSEL0_SIZE                  equ 0001h
OPA1CON1_OPA1GSEL0_LENGTH                equ 0001h
OPA1CON1_OPA1GSEL0_MASK                  equ 0010h
OPA1CON1_OPA1GSEL1_POSN                  equ 0005h
OPA1CON1_OPA1GSEL1_POSITION              equ 0005h
OPA1CON1_OPA1GSEL1_SIZE                  equ 0001h
OPA1CON1_OPA1GSEL1_LENGTH                equ 0001h
OPA1CON1_OPA1GSEL1_MASK                  equ 0020h
OPA1CON1_OPA1GSEL2_POSN                  equ 0006h
OPA1CON1_OPA1GSEL2_POSITION              equ 0006h
OPA1CON1_OPA1GSEL2_SIZE                  equ 0001h
OPA1CON1_OPA1GSEL2_LENGTH                equ 0001h
OPA1CON1_OPA1GSEL2_MASK                  equ 0040h

