GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.inc
// Register: OPA1ORS
#define OPA1ORS OPA1ORS
OPA1ORS                                  equ 0126h
// bitfield definitions
OPA1ORS_ORS_POSN                         equ 0000h
OPA1ORS_ORS_POSITION                     equ 0000h
OPA1ORS_ORS_SIZE                         equ 0008h
OPA1ORS_ORS_LENGTH                       equ 0008h
OPA1ORS_ORS_MASK                         equ 00FFh
OPA1ORS_ORS0_POSN                        equ 0000h
OPA1ORS_ORS0_POSITION                    equ 0000h
OPA1ORS_ORS0_SIZE                        equ 0001h
OPA1ORS_ORS0_LENGTH                      equ 0001h
OPA1ORS_ORS0_MASK                        equ 0001h
OPA1ORS_ORS1_POSN                        equ 0001h
OPA1ORS_ORS1_POSITION                    equ 0001h
OPA1ORS_ORS1_SIZE                        equ 0001h
OPA1ORS_ORS1_LENGTH                      equ 0001h
OPA1ORS_ORS1_MASK                        equ 0002h
OPA1ORS_ORS2_POSN                        equ 0002h
OPA1ORS_ORS2_POSITION                    equ 0002h
OPA1ORS_ORS2_SIZE                        equ 0001h
OPA1ORS_ORS2_LENGTH                      equ 0001h
OPA1ORS_ORS2_MASK                        equ 0004h
OPA1ORS_ORS3_POSN                        equ 0003h
OPA1ORS_ORS3_POSITION                    equ 0003h
OPA1ORS_ORS3_SIZE                        equ 0001h
OPA1ORS_ORS3_LENGTH                      equ 0001h
OPA1ORS_ORS3_MASK                        equ 0008h
OPA1ORS_ORS4_POSN                        equ 0004h
OPA1ORS_ORS4_POSITION                    equ 0004h
OPA1ORS_ORS4_SIZE                        equ 0001h
OPA1ORS_ORS4_LENGTH                      equ 0001h
OPA1ORS_ORS4_MASK                        equ 0010h
OPA1ORS_ORS5_POSN                        equ 0005h
OPA1ORS_ORS5_POSITION                    equ 0005h
OPA1ORS_ORS5_SIZE                        equ 0001h
OPA1ORS_ORS5_LENGTH                      equ 0001h
OPA1ORS_ORS5_MASK                        equ 0020h
OPA1ORS_ORS6_POSN                        equ 0006h
OPA1ORS_ORS6_POSITION                    equ 0006h
OPA1ORS_ORS6_SIZE                        equ 0001h
OPA1ORS_ORS6_LENGTH                      equ 0001h
OPA1ORS_ORS6_MASK                        equ 0040h
OPA1ORS_ORS7_POSN                        equ 0007h
OPA1ORS_ORS7_POSITION                    equ 0007h
OPA1ORS_ORS7_SIZE                        equ 0001h
OPA1ORS_ORS7_LENGTH                      equ 0001h
OPA1ORS_ORS7_MASK                        equ 0080h
OPA1ORS_OPA1ORS_POSN                     equ 0000h
OPA1ORS_OPA1ORS_POSITION                 equ 0000h
OPA1ORS_OPA1ORS_SIZE                     equ 0008h
OPA1ORS_OPA1ORS_LENGTH                   equ 0008h
OPA1ORS_OPA1ORS_MASK                     equ 00FFh
OPA1ORS_OPA1ORS0_POSN                    equ 0000h
OPA1ORS_OPA1ORS0_POSITION                equ 0000h
OPA1ORS_OPA1ORS0_SIZE                    equ 0001h
OPA1ORS_OPA1ORS0_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS0_MASK                    equ 0001h
OPA1ORS_OPA1ORS1_POSN                    equ 0001h
OPA1ORS_OPA1ORS1_POSITION                equ 0001h
OPA1ORS_OPA1ORS1_SIZE                    equ 0001h
OPA1ORS_OPA1ORS1_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS1_MASK                    equ 0002h
OPA1ORS_OPA1ORS2_POSN                    equ 0002h
OPA1ORS_OPA1ORS2_POSITION                equ 0002h
OPA1ORS_OPA1ORS2_SIZE                    equ 0001h
OPA1ORS_OPA1ORS2_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS2_MASK                    equ 0004h
OPA1ORS_OPA1ORS3_POSN                    equ 0003h
OPA1ORS_OPA1ORS3_POSITION                equ 0003h
OPA1ORS_OPA1ORS3_SIZE                    equ 0001h
OPA1ORS_OPA1ORS3_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS3_MASK                    equ 0008h
OPA1ORS_OPA1ORS4_POSN                    equ 0004h
OPA1ORS_OPA1ORS4_POSITION                equ 0004h
OPA1ORS_OPA1ORS4_SIZE                    equ 0001h
OPA1ORS_OPA1ORS4_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS4_MASK                    equ 0010h
OPA1ORS_OPA1ORS5_POSN                    equ 0005h
OPA1ORS_OPA1ORS5_POSITION                equ 0005h
OPA1ORS_OPA1ORS5_SIZE                    equ 0001h
OPA1ORS_OPA1ORS5_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS5_MASK                    equ 0020h
OPA1ORS_OPA1ORS6_POSN                    equ 0006h
OPA1ORS_OPA1ORS6_POSITION                equ 0006h
OPA1ORS_OPA1ORS6_SIZE                    equ 0001h
OPA1ORS_OPA1ORS6_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS6_MASK                    equ 0040h
OPA1ORS_OPA1ORS7_POSN                    equ 0007h
OPA1ORS_OPA1ORS7_POSITION                equ 0007h
OPA1ORS_OPA1ORS7_SIZE                    equ 0001h
OPA1ORS_OPA1ORS7_LENGTH                  equ 0001h
OPA1ORS_OPA1ORS7_MASK                    equ 0080h

// Register: OPA2CON0
#define OPA2CON0 OPA2CON0
OPA2CON0                                 equ 0127h
// bitfield definitions
OPA2CON0_UG_POSN                         equ 0003h
OPA2CON0_UG_POSITION                     equ 0003h
OPA2CON0_UG_SIZE                         equ 0001h
OPA2CON0_UG_LENGTH                       equ 0001h
OPA2CON0_UG_MASK                         equ 0008h
OPA2CON0_CPON_POSN                       equ 0005h
OPA2CON0_CPON_POSITION                   equ 0005h
OPA2CON0_CPON_SIZE                       equ 0001h
OPA2CON0_CPON_LENGTH                     equ 0001h
OPA2CON0_CPON_MASK                       equ 0020h
OPA2CON0_EN_POSN                         equ 0007h
OPA2CON0_EN_POSITION                     equ 0007h
OPA2CON0_EN_SIZE                         equ 0001h
OPA2CON0_EN_LENGTH                       equ 0001h
OPA2CON0_EN_MASK                         equ 0080h
OPA2CON0_UG0_POSN                        equ 0003h
OPA2CON0_UG0_POSITION                    equ 0003h
OPA2CON0_UG0_SIZE                        equ 0001h
OPA2CON0_UG0_LENGTH                      equ 0001h
OPA2CON0_UG0_MASK                        equ 0008h
OPA2CON0_OPA2UG_POSN                     equ 0003h
OPA2CON0_OPA2UG_POSITION                 equ 0003h
OPA2CON0_OPA2UG_SIZE                     equ 0001h
OPA2CON0_OPA2UG_LENGTH                   equ 0001h
OPA2CON0_OPA2UG_MASK                     equ 0008h
OPA2CON0_OPA2CPON_POSN                   equ 0005h
OPA2CON0_OPA2CPON_POSITION               equ 0005h
OPA2CON0_OPA2CPON_SIZE                   equ 0001h
OPA2CON0_OPA2CPON_LENGTH                 equ 0001h
OPA2CON0_OPA2CPON_MASK                   equ 0020h
OPA2CON0_OPA2EN_POSN                     equ 0007h
OPA2CON0_OPA2EN_POSITION                 equ 0007h
OPA2CON0_OPA2EN_SIZE                     equ 0001h
OPA2CON0_OPA2EN_LENGTH                   equ 0001h
OPA2CON0_OPA2EN_MASK                     equ 0080h

// Register: OPA2CON1
#define OPA2CON1 OPA2CON1
OPA2CON1                                 equ 0128h
// bitfield definitions
OPA2CON1_NSS_POSN                        equ 0000h
OPA2CON1_NSS_POSITION                    equ 0000h
OPA2CON1_NSS_SIZE                        equ 0003h
OPA2CON1_NSS_LENGTH                      equ 0003h
OPA2CON1_NSS_MASK                        equ 0007h
OPA2CON1_RESON_POSN                      equ 0003h
OPA2CON1_RESON_POSITION                  equ 0003h
OPA2CON1_RESON_SIZE                      equ 0001h
OPA2CON1_RESON_LENGTH                    equ 0001h
OPA2CON1_RESON_MASK                      equ 0008h
OPA2CON1_GSEL_POSN                       equ 0004h
OPA2CON1_GSEL_POSITION                   equ 0004h
OPA2CON1_GSEL_SIZE                       equ 0003h
OPA2CON1_GSEL_LENGTH                     equ 0003h
OPA2CON1_GSEL_MASK                       equ 0070h
OPA2CON1_NSS0_POSN                       equ 0000h
OPA2CON1_NSS0_POSITION                   equ 0000h
OPA2CON1_NSS0_SIZE                       equ 0001h
OPA2CON1_NSS0_LENGTH                     equ 0001h
OPA2CON1_NSS0_MASK                       equ 0001h
OPA2CON1_NSS1_POSN                       equ 0001h
OPA2CON1_NSS1_POSITION                   equ 0001h
OPA2CON1_NSS1_SIZE                       equ 0001h
OPA2CON1_NSS1_LENGTH                     equ 0001h
OPA2CON1_NSS1_MASK                       equ 0002h
OPA2CON1_NSS2_POSN                       equ 0002h
OPA2CON1_NSS2_POSITION                   equ 0002h
OPA2CON1_NSS2_SIZE                       equ 0001h
OPA2CON1_NSS2_LENGTH                     equ 0001h
OPA2CON1_NSS2_MASK                       equ 0004h
OPA2CON1_GSEL0_POSN                      equ 0004h
OPA2CON1_GSEL0_POSITION                  equ 0004h
OPA2CON1_GSEL0_SIZE                      equ 0001h
OPA2CON1_GSEL0_LENGTH                    equ 0001h
OPA2CON1_GSEL0_MASK                      equ 0010h
OPA2CON1_GSEL1_POSN                      equ 0005h
OPA2CON1_GSEL1_POSITION                  equ 0005h
OPA2CON1_GSEL1_SIZE                      equ 0001h
OPA2CON1_GSEL1_LENGTH                    equ 0001h
OPA2CON1_GSEL1_MASK                      equ 0020h
OPA2CON1_GSEL2_POSN                      equ 0006h
OPA2CON1_GSEL2_POSITION                  equ 0006h
OPA2CON1_GSEL2_SIZE                      equ 0001h
OPA2CON1_GSEL2_LENGTH                    equ 0001h
OPA2CON1_GSEL2_MASK                      equ 0040h
OPA2CON1_OPA2NSS_POSN                    equ 0000h
OPA2CON1_OPA2NSS_POSITION                equ 0000h
OPA2CON1_OPA2NSS_SIZE                    equ 0003h
OPA2CON1_OPA2NSS_LENGTH                  equ 0003h
OPA2CON1_OPA2NSS_MASK                    equ 0007h
OPA2CON1_OPA2RESON_POSN                  equ 0003h
OPA2CON1_OPA2RESON_POSITION              equ 0003h
OPA2CON1_OPA2RESON_SIZE                  equ 0001h
OPA2CON1_OPA2RESON_LENGTH                equ 0001h
OPA2CON1_OPA2RESON_MASK                  equ 0008h
OPA2CON1_OPA2GSEL_POSN                   equ 0004h
OPA2CON1_OPA2GSEL_POSITION               equ 0004h
OPA2CON1_OPA2GSEL_SIZE                   equ 0003h
OPA2CON1_OPA2GSEL_LENGTH                 equ 0003h
OPA2CON1_OPA2GSEL_MASK                   equ 0070h
OPA2CON1_OPA2NSS0_POSN                   equ 0000h
OPA2CON1_OPA2NSS0_POSITION               equ 0000h
OPA2CON1_OPA2NSS0_SIZE                   equ 0001h
OPA2CON1_OPA2NSS0_LENGTH                 equ 0001h
OPA2CON1_OPA2NSS0_MASK                   equ 0001h
OPA2CON1_OPA2NSS1_POSN                   equ 0001h
OPA2CON1_OPA2NSS1_POSITION               equ 0001h
OPA2CON1_OPA2NSS1_SIZE                   equ 0001h
OPA2CON1_OPA2NSS1_LENGTH                 equ 0001h
OPA2CON1_OPA2NSS1_MASK                   equ 0002h
OPA2CON1_OPA2NSS2_POSN                   equ 0002h
OPA2CON1_OPA2NSS2_POSITION               equ 0002h
OPA2CON1_OPA2NSS2_SIZE                   equ 0001h
OPA2CON1_OPA2NSS2_LENGTH                 equ 0001h
OPA2CON1_OPA2NSS2_MASK                   equ 0004h
OPA2CON1_OPA2GSEL0_POSN                  equ 0004h
OPA2CON1_OPA2GSEL0_POSITION              equ 0004h
OPA2CON1_OPA2GSEL0_SIZE                  equ 0001h
OPA2CON1_OPA2GSEL0_LENGTH                equ 0001h
OPA2CON1_OPA2GSEL0_MASK                  equ 0010h
OPA2CON1_OPA2GSEL1_POSN                  equ 0005h
OPA2CON1_OPA2GSEL1_POSITION              equ 0005h
OPA2CON1_OPA2GSEL1_SIZE                  equ 0001h
OPA2CON1_OPA2GSEL1_LENGTH                equ 0001h
OPA2CON1_OPA2GSEL1_MASK                  equ 0020h
OPA2CON1_OPA2GSEL2_POSN                  equ 0006h
OPA2CON1_OPA2GSEL2_POSITION              equ 0006h
OPA2CON1_OPA2GSEL2_SIZE                  equ 0001h
OPA2CON1_OPA2GSEL2_LENGTH                equ 0001h
OPA2CON1_OPA2GSEL2_MASK                  equ 0040h

