GopalSaraf/Practicals/PSDL/include/proc/pic18f56q71.inc
#define NOT_RCM                          BANKMASK(PCON1), 0, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RVREG                        BANKMASK(PCON1), 2, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, b
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, b
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, b
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, b
#define NOT_W                            BANKMASK(I2C1STAT0), 4, b
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NOT_WRITE                        BANKMASK(I2C1STAT0), 4, b
#define NREF0                            BANKMASK(ADREF), 4, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, b
#define NVMADR1                          BANKMASK(NVMADRL), 1, b
#define NVMADR10                         BANKMASK(NVMADRH), 2, b
#define NVMADR11                         BANKMASK(NVMADRH), 3, b
#define NVMADR12                         BANKMASK(NVMADRH), 4, b
#define NVMADR13                         BANKMASK(NVMADRH), 5, b
#define NVMADR14                         BANKMASK(NVMADRH), 6, b
#define NVMADR15                         BANKMASK(NVMADRH), 7, b
#define NVMADR16                         BANKMASK(NVMADRU), 0, b
#define NVMADR17                         BANKMASK(NVMADRU), 1, b
#define NVMADR18                         BANKMASK(NVMADRU), 2, b
#define NVMADR19                         BANKMASK(NVMADRU), 3, b
#define NVMADR2                          BANKMASK(NVMADRL), 2, b
#define NVMADR20                         BANKMASK(NVMADRU), 4, b
#define NVMADR21                         BANKMASK(NVMADRU), 5, b
#define NVMADR3                          BANKMASK(NVMADRL), 3, b
#define NVMADR4                          BANKMASK(NVMADRL), 4, b
#define NVMADR5                          BANKMASK(NVMADRL), 5, b
#define NVMADR6                          BANKMASK(NVMADRL), 6, b
#define NVMADR7                          BANKMASK(NVMADRL), 7, b
#define NVMADR8                          BANKMASK(NVMADRH), 0, b
#define NVMADR9                          BANKMASK(NVMADRH), 1, b
#define NVMDAT0                          BANKMASK(NVMDATL), 0, b
#define NVMDAT1                          BANKMASK(NVMDATL), 1, b
#define NVMDAT10                         BANKMASK(NVMDATH), 2, b
#define NVMDAT11                         BANKMASK(NVMDATH), 3, b
#define NVMDAT12                         BANKMASK(NVMDATH), 4, b
#define NVMDAT13                         BANKMASK(NVMDATH), 5, b
#define NVMDAT14                         BANKMASK(NVMDATH), 6, b
#define NVMDAT15                         BANKMASK(NVMDATH), 7, b
#define NVMDAT2                          BANKMASK(NVMDATL), 2, b
#define NVMDAT3                          BANKMASK(NVMDATL), 3, b
#define NVMDAT4                          BANKMASK(NVMDATL), 4, b
#define NVMDAT5                          BANKMASK(NVMDATL), 5, b
#define NVMDAT6                          BANKMASK(NVMDATL), 6, b
#define NVMDAT7                          BANKMASK(NVMDATL), 7, b
#define NVMDAT8                          BANKMASK(NVMDATH), 0, b
#define NVMDAT9                          BANKMASK(NVMDATH), 1, b
#define NVMGO                            BANKMASK(NVMCON0), 0, b
#define NVMIE                            BANKMASK(PIE0), 4, a
#define NVMIF                            BANKMASK(PIR0), 4, a
#define NVMIP                            BANKMASK(IPR0), 4, a
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define ODCD0                            BANKMASK(ODCOND), 0, b
#define ODCD1                            BANKMASK(ODCOND), 1, b
#define ODCD2                            BANKMASK(ODCOND), 2, b
#define ODCD3                            BANKMASK(ODCOND), 3, b
#define ODCD4                            BANKMASK(ODCOND), 4, b
#define ODCD5                            BANKMASK(ODCOND), 5, b
#define ODCD6                            BANKMASK(ODCOND), 6, b
#define ODCD7                            BANKMASK(ODCOND), 7, b
#define ODCE0                            BANKMASK(ODCONE), 0, b
#define ODCE1                            BANKMASK(ODCONE), 1, b
#define ODCE2                            BANKMASK(ODCONE), 2, b
#define ODCF0                            BANKMASK(ODCONF), 0, b
#define ODCF1                            BANKMASK(ODCONF), 1, b
#define ODCF2                            BANKMASK(ODCONF), 2, b
#define ODCF3                            BANKMASK(ODCONF), 3, b
#define ODCF4                            BANKMASK(ODCONF), 4, b
#define ODCF5                            BANKMASK(ODCONF), 5, b
#define ODCF6                            BANKMASK(ODCONF), 6, b
#define ODCF7                            BANKMASK(ODCONF), 7, b
#define OPA1CPON                         BANKMASK(OPA1CON0), 5, b
#define OPA1EN                           BANKMASK(OPA1CON0), 7, b
#define OPA1FMS0                         BANKMASK(OPA1CON3), 6, b
#define OPA1FMS1                         BANKMASK(OPA1CON3), 7, b
#define OPA1GSEL0                        BANKMASK(OPA1CON1), 4, b
#define OPA1GSEL1                        BANKMASK(OPA1CON1), 5, b
#define OPA1GSEL2                        BANKMASK(OPA1CON1), 6, b
#define OPA1HWCH0                        BANKMASK(OPA1HWC), 4, b
#define OPA1HWCH1                        BANKMASK(OPA1HWC), 5, b
#define OPA1HWCH2                        BANKMASK(OPA1HWC), 6, b
#define OPA1HWCL0                        BANKMASK(OPA1HWC), 0, b
#define OPA1HWCL1                        BANKMASK(OPA1HWC), 1, b
#define OPA1HWCL2                        BANKMASK(OPA1HWC), 2, b
#define OPA1INTOE                        BANKMASK(OPA1CON3), 5, b
#define OPA1MD                           BANKMASK(PMD5), 2, b
#define OPA1NCH0                         BANKMASK(OPA1CON2), 4, b
#define OPA1NCH1                         BANKMASK(OPA1CON2), 5, b
#define OPA1NCH2                         BANKMASK(OPA1CON2), 6, b
#define OPA1NSS0                         BANKMASK(OPA1CON1), 0, b
#define OPA1NSS1                         BANKMASK(OPA1CON1), 1, b
#define OPA1NSS2                         BANKMASK(OPA1CON1), 2, b
#define OPA1OFCSEL0                      BANKMASK(OPA1CON4), 0, b
#define OPA1OFCSEL1                      BANKMASK(OPA1CON4), 1, b
#define OPA1OFCST                        BANKMASK(OPA1CON4), 2, b
#define OPA1OFFSET0                      BANKMASK(OPA1OFFSET), 0, b
#define OPA1OFFSET1                      BANKMASK(OPA1OFFSET), 1, b
#define OPA1OFFSET2                      BANKMASK(OPA1OFFSET), 2, b
#define OPA1OFFSET3                      BANKMASK(OPA1OFFSET), 3, b
#define OPA1OFFSET4                      BANKMASK(OPA1OFFSET), 4, b
#define OPA1OFFSET5                      BANKMASK(OPA1OFFSET), 5, b
#define OPA1OFFSET6                      BANKMASK(OPA1OFFSET), 6, b
#define OPA1OFFSET7                      BANKMASK(OPA1OFFSET), 7, b
#define OPA1OREN                         BANKMASK(OPA1HWC), 7, b
#define OPA1ORPOL                        BANKMASK(OPA1HWC), 3, b
#define OPA1ORS0                         BANKMASK(OPA1ORS), 0, b
#define OPA1ORS1                         BANKMASK(OPA1ORS), 1, b
#define OPA1ORS2                         BANKMASK(OPA1ORS), 2, b
#define OPA1ORS3                         BANKMASK(OPA1ORS), 3, b
#define OPA1ORS4                         BANKMASK(OPA1ORS), 4, b
#define OPA1ORS5                         BANKMASK(OPA1ORS), 5, b
#define OPA1ORS6                         BANKMASK(OPA1ORS), 6, b
#define OPA1ORS7                         BANKMASK(OPA1ORS), 7, b
#define OPA1PCH0                         BANKMASK(OPA1CON2), 0, b
#define OPA1PCH1                         BANKMASK(OPA1CON2), 1, b
#define OPA1PCH2                         BANKMASK(OPA1CON2), 2, b
#define OPA1PPS0                         BANKMASK(OPA1ORPPS), 0, b
#define OPA1PPS1                         BANKMASK(OPA1ORPPS), 1, b
#define OPA1PPS2                         BANKMASK(OPA1ORPPS), 2, b
#define OPA1PPS3                         BANKMASK(OPA1ORPPS), 3, b
#define OPA1PPS4                         BANKMASK(OPA1ORPPS), 4, b
#define OPA1PPS5                         BANKMASK(OPA1ORPPS), 5, b
#define OPA1PSS0                         BANKMASK(OPA1CON3), 0, b
#define OPA1PSS1                         BANKMASK(OPA1CON3), 1, b
#define OPA1PSS2                         BANKMASK(OPA1CON3), 2, b
#define OPA1PSS3                         BANKMASK(OPA1CON3), 3, b
#define OPA1PSS4                         BANKMASK(OPA1CON3), 4, b
#define OPA1PTRES                        BANKMASK(OPA1CON4), 4, b
#define OPA1RESON                        BANKMASK(OPA1CON1), 3, b
#define OPA1UG                           BANKMASK(OPA1CON0), 3, b
#define OPA2CPON                         BANKMASK(OPA2CON0), 5, b
#define OPA2EN                           BANKMASK(OPA2CON0), 7, b
#define OPA2FMS0                         BANKMASK(OPA2CON3), 6, b
#define OPA2FMS1                         BANKMASK(OPA2CON3), 7, b
#define OPA2GSEL0                        BANKMASK(OPA2CON1), 4, b
#define OPA2GSEL1                        BANKMASK(OPA2CON1), 5, b
#define OPA2GSEL2                        BANKMASK(OPA2CON1), 6, b
#define OPA2HWCH0                        BANKMASK(OPA2HWC), 4, b
#define OPA2HWCH1                        BANKMASK(OPA2HWC), 5, b
#define OPA2HWCH2                        BANKMASK(OPA2HWC), 6, b
#define OPA2HWCL0                        BANKMASK(OPA2HWC), 0, b
#define OPA2HWCL1                        BANKMASK(OPA2HWC), 1, b
#define OPA2HWCL2                        BANKMASK(OPA2HWC), 2, b
#define OPA2INTOE                        BANKMASK(OPA2CON3), 5, b
#define OPA2MD                           BANKMASK(PMD5), 3, b
#define OPA2NCH0                         BANKMASK(OPA2CON2), 4, b
#define OPA2NCH1                         BANKMASK(OPA2CON2), 5, b
#define OPA2NCH2                         BANKMASK(OPA2CON2), 6, b
#define OPA2NSS0                         BANKMASK(OPA2CON1), 0, b
#define OPA2NSS1                         BANKMASK(OPA2CON1), 1, b
#define OPA2NSS2                         BANKMASK(OPA2CON1), 2, b
#define OPA2OFCSEL0                      BANKMASK(OPA2CON4), 0, b
#define OPA2OFCSEL1                      BANKMASK(OPA2CON4), 1, b
#define OPA2OFCST                        BANKMASK(OPA2CON4), 2, b
#define OPA2OFFSET0                      BANKMASK(OPA2OFFSET), 0, b
#define OPA2OFFSET1                      BANKMASK(OPA2OFFSET), 1, b
#define OPA2OFFSET2                      BANKMASK(OPA2OFFSET), 2, b
#define OPA2OFFSET3                      BANKMASK(OPA2OFFSET), 3, b
#define OPA2OFFSET4                      BANKMASK(OPA2OFFSET), 4, b
#define OPA2OFFSET5                      BANKMASK(OPA2OFFSET), 5, b
#define OPA2OFFSET6                      BANKMASK(OPA2OFFSET), 6, b
#define OPA2OFFSET7                      BANKMASK(OPA2OFFSET), 7, b
#define OPA2OREN                         BANKMASK(OPA2HWC), 7, b
#define OPA2ORPOL                        BANKMASK(OPA2HWC), 3, b
#define OPA2ORS0                         BANKMASK(OPA2ORS), 0, b
#define OPA2ORS1                         BANKMASK(OPA2ORS), 1, b
#define OPA2ORS2                         BANKMASK(OPA2ORS), 2, b
#define OPA2ORS3                         BANKMASK(OPA2ORS), 3, b
#define OPA2ORS4                         BANKMASK(OPA2ORS), 4, b
#define OPA2PCH0                         BANKMASK(OPA2CON2), 0, b
#define OPA2PCH1                         BANKMASK(OPA2CON2), 1, b
#define OPA2PCH2                         BANKMASK(OPA2CON2), 2, b
#define OPA2PPS0                         BANKMASK(OPA2ORPPS), 0, b
#define OPA2PPS1                         BANKMASK(OPA2ORPPS), 1, b
#define OPA2PPS2                         BANKMASK(OPA2ORPPS), 2, b
#define OPA2PPS3                         BANKMASK(OPA2ORPPS), 3, b
#define OPA2PPS4                         BANKMASK(OPA2ORPPS), 4, b
#define OPA2PPS5                         BANKMASK(OPA2ORPPS), 5, b
#define OPA2PSS0                         BANKMASK(OPA2CON3), 0, b
#define OPA2PSS1                         BANKMASK(OPA2CON3), 1, b
#define OPA2PTRES                        BANKMASK(OPA2CON4), 4, b
#define OPA2RESON                        BANKMASK(OPA2CON1), 3, b
#define OPA2UG                           BANKMASK(OPA2CON0), 3, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define ORS                              BANKMASK(ACTCON), 1, b
#define ORS5                             BANKMASK(OPA1ORS), 5, b
#define ORS6                             BANKMASK(OPA1ORS), 6, b
#define ORS7                             BANKMASK(OPA1ORS), 7, b
#define OSFIE                            BANKMASK(PIE0), 2, a
#define OSFIF                            BANKMASK(PIR0), 2, a
#define OSFIP                            BANKMASK(IPR0), 2, a
#define OUT0                             BANKMASK(CRCOUTL), 0, b
#define OUT1                             BANKMASK(CRCOUTL), 1, b
#define OUT10                            BANKMASK(CRCOUTH), 2, b
#define OUT11                            BANKMASK(CRCOUTH), 3, b
#define OUT12                            BANKMASK(CRCOUTH), 4, b
#define OUT13                            BANKMASK(CRCOUTH), 5, b
#define OUT14                            BANKMASK(CRCOUTH), 6, b
#define OUT15                            BANKMASK(CRCOUTH), 7, b
#define OUT16                            BANKMASK(CRCOUTU), 0, b
#define OUT17                            BANKMASK(CRCOUTU), 1, b
#define OUT18                            BANKMASK(CRCOUTU), 2, b
#define OUT19                            BANKMASK(CRCOUTU), 3, b
#define OUT2                             BANKMASK(CRCOUTL), 2, b
#define OUT20                            BANKMASK(CRCOUTU), 4, b
#define OUT21                            BANKMASK(CRCOUTU), 5, b
#define OUT22                            BANKMASK(CRCOUTU), 6, b
#define OUT23                            BANKMASK(CRCOUTU), 7, b
#define OUT24                            BANKMASK(CRCOUTT), 0, b
#define OUT25                            BANKMASK(CRCOUTT), 1, b
#define OUT26                            BANKMASK(CRCOUTT), 2, b
#define OUT27                            BANKMASK(CRCOUTT), 3, b
#define OUT28                            BANKMASK(CRCOUTT), 4, b
#define OUT29                            BANKMASK(CRCOUTT), 5, b
#define OUT3                             BANKMASK(CRCOUTL), 3, b
#define OUT30                            BANKMASK(CRCOUTT), 6, b
#define OUT31                            BANKMASK(CRCOUTT), 7, b
#define OUT4                             BANKMASK(CRCOUTL), 4, b
#define OUT5                             BANKMASK(CRCOUTL), 5, b
#define OUT6                             BANKMASK(CRCOUTL), 6, b
#define OUT7                             BANKMASK(CRCOUTL), 7, b
#define OUT8                             BANKMASK(CRCOUTH), 0, b
#define OUT9                             BANKMASK(CRCOUTH), 1, b
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P1H                              BANKMASK(U1P1H), 0, b
#define P2H                              BANKMASK(U1P2H), 0, b
#define P3H                              BANKMASK(U1P3H), 0, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PCIE                             BANKMASK(I2C1PIE), 2, b
#define PCIF                             BANKMASK(I2C1PIR), 2, b
#define PCSC                             BANKMASK(ADCON1), 1, b
#define PER0                             BANKMASK(APMPERL), 0, b
#define PER1                             BANKMASK(APMPERL), 1, b
#define PER10                            BANKMASK(APMPERH), 2, b
#define PER11                            BANKMASK(APMPERH), 3, b
#define PER12                            BANKMASK(APMPERH), 4, b
#define PER13                            BANKMASK(APMPERH), 5, b
#define PER14                            BANKMASK(APMPERH), 6, b
#define PER15                            BANKMASK(APMPERH), 7, b
#define PER2                             BANKMASK(APMPERL), 2, b
#define PER3                             BANKMASK(APMPERL), 3, b
#define PER4                             BANKMASK(APMPERL), 4, b
#define PER5                             BANKMASK(APMPERL), 5, b
#define PER6                             BANKMASK(APMPERL), 6, b
#define PER7                             BANKMASK(APMPERL), 7, b
#define PER8                             BANKMASK(APMPERH), 0, b
#define PER9                             BANKMASK(APMPERH), 1, b
#define PFM                              BANKMASK(NCO1CON), 0, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLEN4                            BANKMASK(CRCCON1), 4, b
#define PLLEN                            BANKMASK(OSCEN), 0, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define PMSYS0                           BANKMASK(VREGCON), 4, b
#define PMSYS1                           BANKMASK(VREGCON), 5, b
#define POLA                             BANKMASK(CWG1CON1), 0, b
#define POLB                             BANKMASK(CWG1CON1), 1, b
#define POLC                             BANKMASK(CWG1CON1), 2, b
#define POLD                             BANKMASK(CWG1CON1), 3, b
#define POR                              BANKMASK(PCON0), 1, a
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PRE13                            BANKMASK(APMPREH), 5, b
#define PRE14                            BANKMASK(APMPREH), 6, b
#define PRE15                            BANKMASK(APMPREH), 7, b
#define PREF0                            BANKMASK(ADREF), 0, b
#define PREF1                            BANKMASK(ADREF), 1, b
#define PREV0                            BANKMASK(ADPREVL), 0, b
#define PREV1                            BANKMASK(ADPREVL), 1, b
#define PREV10                           BANKMASK(ADPREVH), 2, b
#define PREV11                           BANKMASK(ADPREVH), 3, b
#define PREV12                           BANKMASK(ADPREVH), 4, b
#define PREV13                           BANKMASK(ADPREVH), 5, b
#define PREV14                           BANKMASK(ADPREVH), 6, b
#define PREV15                           BANKMASK(ADPREVH), 7, b
#define PREV2                            BANKMASK(ADPREVL), 2, b
#define PREV3                            BANKMASK(ADPREVL), 3, b
#define PREV4                            BANKMASK(ADPREVL), 4, b
#define PREV5                            BANKMASK(ADPREVL), 5, b
#define PREV6                            BANKMASK(ADPREVL), 6, b
#define PREV7                            BANKMASK(ADPREVL), 7, b
#define PREV8                            BANKMASK(ADPREVH), 0, b
#define PREV9                            BANKMASK(ADPREVH), 1, b
#define PRLOCKED                         BANKMASK(PRLOCK), 0, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PSS2                             BANKMASK(OPA1CON3), 2, b
#define PSS3                             BANKMASK(OPA1CON3), 3, b
#define PSS4                             BANKMASK(OPA1CON3), 4, b
#define PWCLKEN                          BANKMASK(VPORTCON), 0, b
#define PWDF0                            BANKMASK(PORTWDF), 0, b
#define PWDF1                            BANKMASK(PORTWDF), 1, b
#define PWDF2                            BANKMASK(PORTWDF), 2, b
#define PWDF3                            BANKMASK(PORTWDF), 3, b
#define PWDF4                            BANKMASK(PORTWDF), 4, b
#define PWDF5                            BANKMASK(PORTWDF), 5, b
#define PWDF6                            BANKMASK(PORTWDF), 6, b
#define PWDF7                            BANKMASK(PORTWDF), 7, b
#define PWM1ERSPPS0                      BANKMASK(PWM1ERSPPS), 0, b
#define PWM1ERSPPS1                      BANKMASK(PWM1ERSPPS), 1, b
#define PWM1ERSPPS2                      BANKMASK(PWM1ERSPPS), 2, b
#define PWM1ERSPPS3                      BANKMASK(PWM1ERSPPS), 3, b
#define PWM1ERSPPS4                      BANKMASK(PWM1ERSPPS), 4, b
#define PWM1ERSPPS5                      BANKMASK(PWM1ERSPPS), 5, b
#define PWM1IE                           BANKMASK(PIE4), 7, a
#define PWM1IF                           BANKMASK(PIR4), 7, a
#define PWM1IP                           BANKMASK(IPR4), 7, a
#define PWM1MD                           BANKMASK(PMD3), 0, b
#define PWM1PIE                          BANKMASK(PIE4), 6, a
#define PWM1PIF                          BANKMASK(PIR4), 6, a
#define PWM1PIP                          BANKMASK(IPR4), 6, a
#define PWM2ERSPPS0                      BANKMASK(PWM2ERSPPS), 0, b
#define PWM2ERSPPS1                      BANKMASK(PWM2ERSPPS), 1, b
#define PWM2ERSPPS2                      BANKMASK(PWM2ERSPPS), 2, b
#define PWM2ERSPPS3                      BANKMASK(PWM2ERSPPS), 3, b
#define PWM2ERSPPS4                      BANKMASK(PWM2ERSPPS), 4, b
#define PWM2ERSPPS5                      BANKMASK(PWM2ERSPPS), 5, b
#define PWM2IE                           BANKMASK(PIE5), 7, a
